Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияЗапасов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассахККМ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваВКассахККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКассахККМ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытаЧекиЗаархивированы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассахККМ</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОрдера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПлатежаСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеВКассу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОплатаПлатежнымиКартами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылочныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧекаЭТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КассоваяСмена/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаКассоваяСмена, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаШапка.Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.КассаККМ КАК КассаККМ,
		|	ВременнаяТаблицаШапка.СтатусКассовойСмены,
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	НЕ ВременнаяТаблицаШапка.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваВКассахККМ", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредстваВКассахККМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуДенежныеСредства(ДокументСсылкаКассоваяСмена, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаШапка.Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Касса КАК БанковскийСчетКасса,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
		|	ВременнаяТаблицаШапка.СтатусКассовойСмены,
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	НЕ ВременнаяТаблицаШапка.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредства()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКассоваяСмена, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассоваяСмена.Организация,
		|	КассоваяСмена.Касса,
		|	КассоваяСмена.СуммаДокумента,
		|	КассоваяСмена.Дата КАК Период,
		|	КассоваяСмена.КассаККМ,
		|	КассоваяСмена.СтатусКассовойСмены
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.КассоваяСмена КАК КассоваяСмена
		|ГДЕ
		|	КассоваяСмена.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКассоваяСмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаДенежныеСредстваВКассахККМ(ДокументСсылкаКассоваяСмена, СтруктураДополнительныеСвойства);
	СформироватьТаблицуДенежныеСредства(ДокументСсылкаКассоваяСмена, СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Функция формирует табличный документ обложки кассовой книги
//
Функция СформироватьПечатнуюФормуКМ6(МассивОбъектов, ОбъектыПечати)
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.КассоваяСмена.ПФ_MXL_КМ6");
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КМ6";
	
	ПервыйДокумент = Истина;
	
	Для каждого КассоваяСмена Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ТЧЗапасы.Сумма), 0) КАК Сумма,
		|	ОтчетОРозничныхПродажах.КассаККМ КАК КассаККМ,
		|	ОтчетОРозничныхПродажах.КассаККМ.ПодключаемоеОборудование КАК ККМПредставление,
		|	ОтчетОРозничныхПродажах.Организация КАК Организация,
		|	ОтчетОРозничныхПродажах.Организация.Префикс КАК Префикс,
		|	ОтчетОРозничныхПродажах.Номер КАК НомерДокумента,
		|	ОтчетОРозничныхПродажах.Дата КАК ДатаДокумента,
		|	ОтчетОРозничныхПродажах.ВалютаДокумента КАК Валюта,
		|	ОтчетОРозничныхПродажах.НачалоКассовойСмены КАК НачалоСмены,
		|	ОтчетОРозничныхПродажах.ОкончаниеКассовойСмены КАК ОкончаниеСмены,
		|	ОтчетОРозничныхПродажах.Номер,
		|	ОтчетОРозничныхПродажах.Организация.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
		|	ОтчетОРозничныхПродажах.Организация.ИНН КАК ИНН
		|ИЗ
		|	Документ.КассоваяСмена КАК ОтчетОРозничныхПродажах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.РасшифровкаПлатежа КАК ТЧЗапасы
		|		ПО (ТЧЗапасы.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.Ссылка)
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Ссылка = &ОтчетОРозничныхПродажах
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетОРозничныхПродажах.Организация,
		|	ОтчетОРозничныхПродажах.Номер,
		|	ОтчетОРозничныхПродажах.Дата,
		|	ОтчетОРозничныхПродажах.ВалютаДокумента,
		|	ОтчетОРозничныхПродажах.НачалоКассовойСмены,
		|	ОтчетОРозничныхПродажах.ОкончаниеКассовойСмены,
		|	ОтчетОРозничныхПродажах.КассаККМ,
		|	ОтчетОРозничныхПродажах.КассаККМ.ПодключаемоеОборудование,
		|	ОтчетОРозничныхПродажах.Организация.Префикс,
		|	ОтчетОРозничныхПродажах.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ТЧЗапасы.Сумма), 0) КАК Сумма,
		|	ОтчетОРозничныхПродажах.КассаККМ КАК КассаККМ,
		|	ОтчетОРозничныхПродажах.КассаККМ.ПодключаемоеОборудование КАК ККМПредставление,
		|	ОтчетОРозничныхПродажах.Организация КАК Организация,
		|	ОтчетОРозничныхПродажах.Организация.Префикс КАК Префикс,
		|	ОтчетОРозничныхПродажах.Номер КАК НомерДокумента,
		|	ОтчетОРозничныхПродажах.Дата КАК ДатаДокумента,
		|	ОтчетОРозничныхПродажах.ВалютаДокумента КАК Валюта,
		|	ОтчетОРозничныхПродажах.НачалоКассовойСмены КАК НачалоСмены,
		|	ОтчетОРозничныхПродажах.ОкончаниеКассовойСмены КАК ОкончаниеСмены,
		|	ОтчетОРозничныхПродажах.Номер
		|ИЗ
		|	Документ.КассоваяСмена КАК ОтчетОРозничныхПродажах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.РасшифровкаПлатежа КАК ТЧЗапасы
		|		ПО (ТЧЗапасы.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.Ссылка)
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Ссылка = &ОтчетОРозничныхПродажах
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетОРозничныхПродажах.Организация,
		|	ОтчетОРозничныхПродажах.Номер,
		|	ОтчетОРозничныхПродажах.Дата,
		|	ОтчетОРозничныхПродажах.ВалютаДокумента,
		|	ОтчетОРозничныхПродажах.НачалоКассовойСмены,
		|	ОтчетОРозничныхПродажах.ОкончаниеКассовойСмены,
		|	ОтчетОРозничныхПродажах.КассаККМ,
		|	ОтчетОРозничныхПродажах.КассаККМ.ПодключаемоеОборудование,
		|	ОтчетОРозничныхПродажах.Организация.Префикс,
		|	ОтчетОРозничныхПродажах.Номер";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ОтчетОРозничныхПродажах", КассоваяСмена);
		Результат = Запрос.ВыполнитьПакет();
		
		Продажи = Результат[0].Выбрать();
		Продажи.Следующий();
		
		Возвраты = Результат[1].Выбрать();
		Возвраты.Следующий();
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Продажи.Номер, Истина, Истина);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Продажи);
		ОбластьМакета.Параметры.ОрганизацияПредставление = Продажи.Организация.НаименованиеПолное;
		ОбластьМакета.Параметры.ДатаДокумента            = Продажи.ДатаДокумента;
		ОбластьМакета.Параметры.ОрганизацияПоЕДРПОУ      = Продажи.КодПоЕДРПОУ;
		ОбластьМакета.Параметры.ОрганизацияИНН           = Продажи.ИНН;
		ОбластьМакета.Параметры.ПрограммаУчета           = НСтр("ru='1С:Предприятие 8';uk='1С:Підприємство 8'", КодЯзыкаПечать);
		ОбластьМакета.Параметры.НомерДокумента           = НомерДокумента;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ОбластьМакета.Параметры.Заполнить(Продажи);
		ОбластьМакета.Параметры.Итого = Продажи.Сумма;
		ОбластьМакета.Параметры.ИтогоВозврат = Возвраты.Сумма;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итог");
		
		ОбластьМакета.Параметры.Итого = Продажи.Сумма;
		ОбластьМакета.Параметры.ИтогоВозврат = Возвраты.Сумма;
		
		Если ЗначениеЗаполнено(Продажи.Сумма) Тогда
			
			ОбластьМакета.Параметры.СуммаВыручкиПрописью = ОСМДСервер.ФорматироватьСуммуПрописьюПлатежногоДокумента(
			Продажи.Сумма - Возвраты.Сумма, Продажи.Валюта, Ложь, КодЯзыкаПечать);
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Оборот");
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПечатьСОборотом");
		ТабДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, КассоваяСмена);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // СформироватьПечатнуюФормуКМ6()

// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КМ6") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"КМ6",
			"Отчет за смену",
			СформироватьПечатнуюФормуКМ6(МассивОбъектов, ОбъектыПечати)
		);
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОТКРЫТИЯ И ЗАКРЫТИЯ СМЕНЫ

// Функция выполняет открытие кассовой смены.
//
Функция ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки = "") Экспорт
	
	ВыполненоУспешно = Истина;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	ДатаОткрытияКассовойСмены = ТекущаяДата();
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
		Если ДатаОткрытияКассовойСмены - СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса < 86400 Тогда
			
			// Все в порядке
			
		Иначе
			
			ВыполненоУспешно = Ложь;
			// Вероятно, что смена была не закрыта.
			ОписаниеОшибки = НСтр("ru='С момента открытия кассовой смены истекло более 24 часов. Необходимо выполнить закрытие кассовой смены.';uk='З моменту відкриття касової зміни минуло більше 24 годин. Необхідно виконати закриття касової зміни.'");
			
		КонецЕсли;
		
	Иначе
		
		// Смена закрыта. Откроем новую кассовую смену.
		
		НоваяКассоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
		НоваяКассоваяСмена.Автор = Пользователи.ТекущийПользователь();
		НоваяКассоваяСмена.Заполнить(Новый Структура("КассаККМ", КассаККМ));
		
		НоваяКассоваяСмена.Дата                   = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.СтатусКассовойСмены    = Перечисления.СтатусыКассовойСмены.Открыта;
		НоваяКассоваяСмена.НачалоКассовойСмены    = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.ОкончаниеКассовойСмены = '00010101';
		
		Если НоваяКассоваяСмена.ПроверитьЗаполнение() Тогда
			НоваяКассоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ВыполненоУспешно = Ложь;
			ОписаниеОшибки = НСтр("ru='Проверьте настройки кассы ККМ.';uk='Перевірте налаштування каси ККМ.'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВыполненоУспешно;
	
КонецФункции // ОткрытьКассовуюСмену()

// Функция выполняет закрытие кассовой смены.
//
Функция ЗакрытьКассовуюСмену(КассоваяСменаОбъект, Касса) Экспорт
	
	СтруктураВозвращаемоеЗначение = Новый Структура;
	СтруктураВозвращаемоеЗначение.Вставить("КассоваяСмена");
	СтруктураВозвращаемоеЗначение.Вставить("ОписаниеОшибки");
	
	НачатьТранзакцию();
	
	Попытка
		
		// Подготовка данных.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЧекККМРасшифровкаПлатежа.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМРасшифровкаПлатежа.СуммаДокумента КАК Сумма
		|	ИЗ
		|		Документ.ЧекККМ КАК ЧекККМРасшифровкаПлатежа
		|	ГДЕ
		|		ЧекККМРасшифровкаПлатежа.КассоваяСмена = &КассоваяСмена
		|		И ЧекККМРасшифровкаПлатежа.Проведен
		|		И ЧекККМРасшифровкаПлатежа.НомерЧекаККМ > 0
		|		И НЕ ЧекККМРасшифровкаПлатежа.Архивный
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-ЧекККМРасшифровкаПлатежа.СуммаДокумента
		|	ИЗ
		|		Документ.ЧекККМВозврат КАК ЧекККМРасшифровкаПлатежа
		|	ГДЕ
		|		ЧекККМРасшифровкаПлатежа.КассоваяСмена = &КассоваяСмена
		|		И ЧекККМРасшифровкаПлатежа.Проведен
		|		И ЧекККМРасшифровкаПлатежа.НомерЧекаККМ > 0
		|		И НЕ ЧекККМРасшифровкаПлатежа.Архивный
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		-ЧекККМОплатаПлатежнымиКартами.Сумма
		|	ИЗ
		|		Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|	ГДЕ
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассоваяСмена = &КассоваяСмена
		|		И ЧекККМОплатаПлатежнымиКартами.Ссылка.Проведен
		|		И ЧекККМОплатаПлатежнымиКартами.Ссылка.НомерЧекаККМ > 0
		|		И НЕ ЧекККМОплатаПлатежнымиКартами.Ссылка.Архивный
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекККМОплатаПлатежнымиКартами.Сумма
		|	ИЗ
		|		Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|	ГДЕ
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассоваяСмена = &КассоваяСмена
		|		И ЧекККМОплатаПлатежнымиКартами.Ссылка.Проведен
		|		И ЧекККМОплатаПлатежнымиКартами.Ссылка.НомерЧекаККМ > 0
		|		И НЕ ЧекККМОплатаПлатежнымиКартами.Ссылка.Архивный) КАК ЧекККМРасшифровкаПлатежа";
		
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСменаОбъект.Ссылка);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			СуммаДокумента = Результат.Сумма;	
		Иначе
			СуммаДокумента = 0;	
		КонецЕсли;
		
		ДатаЗакрытияКассовойСмены = ТекущаяДата();
		КассоваяСменаОбъект.СтатусКассовойСмены    = Перечисления.СтатусыКассовойСмены.Закрыта;
		КассоваяСменаОбъект.Дата                   = ДатаЗакрытияКассовойСмены;
		КассоваяСменаОбъект.ОкончаниеКассовойСмены = ДатаЗакрытияКассовойСмены;
		КассоваяСменаОбъект.Касса = Касса;
		КассоваяСменаОбъект.СуммаДокумента = СуммаДокумента;
		
		КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
		
		СтруктураВозвращаемоеЗначение.КассоваяСмена = КассоваяСменаОбъект.Ссылка;
		СтруктураВозвращаемоеЗначение.ОписаниеОшибки = "";
		
	Исключение
		
		ОтменитьТранзакцию();
		
		СтруктураВозвращаемоеЗначение.КассоваяСмена = Неопределено;
		СтруктураВозвращаемоеЗначение.ОписаниеОшибки = НСтр("ru='При закрытии кассовой смены произошла ошибка."
"Закрытие кассовой смены не выполнено."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При закритті касової зміни сталася помилка."
"Закриття касової зміни не виконано."
"Додатковий опис:"
"%ДополнительноеОписание%'"
		);
		СтруктураВозвращаемоеЗначение.ОписаниеОшибки = СтрЗаменить(СтруктураВозвращаемоеЗначение.ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
		
	КонецПопытки;
	
	Возврат СтруктураВозвращаемоеЗначение;
	
КонецФункции // ЗакрытьКассовуюСмену()

// Функция выполняет архивацию чеков ККМ по кассовой смене.
//
Процедура ВыполнитьАрхивациюЧековККМ(КассоваяСменаОбъект, ОписаниеОшибки = "") Экспорт
	
	НачатьТранзакцию();

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	(НЕ ЧекККМ.Архивный)
	|	И ЧекККМ.Проведен
	|	И ЧекККМ.НомерЧекаККМ > 0
	|	И ЧекККМ.КассоваяСмена = &КассоваяСмена
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ЧекККМВозврат.Ссылка
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	(НЕ ЧекККМВозврат.Архивный)
	|	И ЧекККМВозврат.Проведен
	|	И ЧекККМВозврат.НомерЧекаККМ > 0
	|	И ЧекККМВозврат.КассоваяСмена = &КассоваяСмена
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок");
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСменаОбъект.Ссылка);
	ВыборкаЧековККМ = Запрос.Выполнить().Выбрать();
	
	Попытка
		
		Пока ВыборкаЧековККМ.Следующий() Цикл
			ЧекККМОбъект = ВыборкаЧековККМ.Ссылка.ПолучитьОбъект();
			ЧекККМОбъект.Архивный = Истина;
			ЧекККМОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
		КассоваяСменаОбъект.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.ЗакрытаЧекиЗаархивированы;
		КассоваяСменаОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
		КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ОписаниеОшибки = НСтр("ru='При архивации чеков ККМ произошла ошибка."
"Архивация чеков ККМ не выполнена."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При архівації чеків ККМ сталася помилка."
"Архівація чеків ККМ не виконано."
"Додатковий опис:"
"%ДополнительноеОписание%'"
		);
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);

	КонецПопытки;

КонецПроцедуры // ВыполнитьАрхивациюЧековККМ()

// Процедура выполняет закрытие кассовой смены.
//
Функция ЗакрытьКассовуюСменуВыполнитьАрхивацию(КассаККМ, Касса, ОписаниеОшибки = "") Экспорт
	
	МассивДокументов = Новый Массив;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		КассоваяСменаОбъект = СтруктураСостояниеКассовойСмены.КассоваяСмена.ПолучитьОбъект();
		
		СтруктураВозвращаемоеЗначение = Документы.КассоваяСмена.ЗакрытьКассовуюСмену(КассоваяСменаОбъект, Касса);
		Если СтруктураВозвращаемоеЗначение.КассоваяСмена = Неопределено Тогда
			
			ОписаниеОшибки = СтруктураВозвращаемоеЗначение.ОписаниеОшибки;
			
		Иначе
			
			МассивДокументов.Добавить(СтруктураВозвращаемоеЗначение.КассоваяСмена);
			
			ВыполнитьАрхивациюЧековККМ(СтруктураСостояниеКассовойСмены.КассоваяСмена.ПолучитьОбъект(), ОписаниеОшибки);
			
		КонецЕсли;
		
	Иначе
		
		// Смена не открыта.
		
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции // СнятьZОтчет()

//////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ПРОВЕРКИ СОСТОЯНИЯ СМЕНЫ

// Функция возвращает пустую структуру состояния кассовой смены.
//
Функция ПолучитьСтруктуруОписанияКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;
	СостояниеКассовойСмены.Вставить("ДатаИзмененияСтатуса");
	СостояниеКассовойСмены.Вставить("СтатусКассовойСмены");
	СостояниеКассовойСмены.Вставить("КассоваяСмена");
	СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	
	// Описание реквизитов кассовой смены
	СостояниеКассовойСмены.Вставить("КассаККМ");
	СостояниеКассовойСмены.Вставить("ВалютаДокумента");
	СостояниеКассовойСмены.Вставить("ВалютаДокументаПредставление");
	СостояниеКассовойСмены.Вставить("Организация");
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции // ПолучитьСтруктуруОписанияКассовойСмены()

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
Функция ПолучитьСостояниеКассовойСмены(КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.СтатусКассовойСмены КАК СтатусКассовойСмены,
	|	КассоваяСмена.КассаККМ КАК КассаККМ,
	|	КассоваяСмена.ВалютаДокумента КАК ВалютаДокумента,
	|	КассоваяСмена.ВалютаДокумента.Представление КАК ВалютаДокументаПредставление,
	|	КассоваяСмена.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса,
	|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаОстаток, 0) КАК НаличностьВКассе
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(, КассаККМ = &КассаККМ) КАК ДенежныеСредстваВКассахККМОстатки
	|		ПО КассоваяСмена.КассаККМ = ДенежныеСредстваВКассахККМОстатки.КассаККМ
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.КассаККМ = &КассаККМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ,
	|	КассоваяСмена УБЫВ";
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции // ПолучитьСостояниеКассовойСмены()

// Функция возвращает структуру, характеризующую состояние кассовой смены на дату.
//
Функция ПолучитьРеквизитыКассовойСменыНаДату(КассаККМ, ДатаВремя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.СтатусКассовойСмены КАК СтатусКассовойСмены,
	|	КассоваяСмена.КассаККМ КАК КассаККМ,
	|	КассоваяСмена.ВалютаДокумента КАК ВалютаДокумента,
	|	КассоваяСмена.ВалютаДокумента.Представление КАК ВалютаДокументаПредставление,
	|	КассоваяСмена.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса,
	|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаОстаток, 0) КАК НаличностьВКассе
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ) КАК ДатаИзмененияСтатуса,
	|		КассоваяСмена.КассаККМ КАК КассаККМ
	|	ИЗ
	|		Документ.КассоваяСмена КАК КассоваяСмена
	|	ГДЕ
	|		КассоваяСмена.Проведен
	|		И КассоваяСмена.КассаККМ = &КассаККМ
	|		И ВЫБОР
	|				КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ <= &ДатаВремя
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КассоваяСмена.КассаККМ) КАК КассовыеСмены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
	|		ПО КассовыеСмены.КассаККМ = КассоваяСмена.КассаККМ
	|			И (КассовыеСмены.ДатаИзмененияСтатуса = ВЫБОР
	|				КОГДА КассоваяСмена.СтатусКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(&ДатаВремя, КассаККМ = &КассаККМ) КАК ДенежныеСредстваВКассахККМОстатки
	|		ПО КассовыеСмены.КассаККМ = ДенежныеСредстваВКассахККМОстатки.КассаККМ";
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	Запрос.УстановитьПараметр("ДатаВремя", ДатаВремя+100);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СостояниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СостояниеКассовойСмены, Выборка);
	КонецЕсли;
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции // ПолучитьРеквизитыКассовойСменыНаДату()

// Функция получает открытую кассовую смену по Кассе ККМ в заданный период.
// Используется для контроля пересечения кассовых смен.
// За один период может одновременно существовать только одна кассовая смена.
//
Функция ПолучитьОткрытуюКассовуюСмену(КассаККМ, КассоваяСмена = Неопределено, НачалоКассовойСмены, ОкончаниеКассовойСмены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.НачалоКассовойСмены <= &НачалоКассовойСмены
	|	И ВЫБОР
	|			КОГДА КассоваяСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены >= &НачалоКассовойСмены
	|		КОНЕЦ
	|	И КассоваяСмена.КассаККМ = &КассаККМ
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	&ОкончаниеКассовойСмены <> ДАТАВРЕМЯ(1, 1, 1)
	|	И КассоваяСмена.НачалоКассовойСмены <= &ОкончаниеКассовойСмены
	|	И ВЫБОР
	|			КОГДА КассоваяСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены >= &ОкончаниеКассовойСмены
	|		КОНЕЦ
	|	И КассоваяСмена.КассаККМ = &КассаККМ
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	&ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|	И КассоваяСмена.НачалоКассовойСмены >= &НачалоКассовойСмены
	|	И КассоваяСмена.КассаККМ = &КассаККМ
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен";
	
	Запрос.УстановитьПараметр("КассаККМ",               КассаККМ);
	Запрос.УстановитьПараметр("НачалоКассовойСмены",    НачалоКассовойСмены);
	Запрос.УстановитьПараметр("ОкончаниеКассовойСмены", ОкончаниеКассовойСмены);
	Запрос.УстановитьПараметр("КассоваяСмена",          КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьОткрытуюКассовуюСмену()

// Функция проверяет состояние кассовой смены на дату. Если смена не открыта - возвращаеся описание ошибки.
//
Функция СменаОткрыта(КассоваяСмена, Дата, ОписаниеОшибки = "") Экспорт
	
	СменаОткрыта = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассоваяСмена.СтатусКассовойСмены КАК СтатусКассовойСмены,
	|	КассоваяСмена.НачалоКассовойСмены КАК НачалоКассовойСмены,
	|	КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Ссылка = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
			
			// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
			Если Дата - Выборка.НачалоКассовойСмены < 86400 Тогда
				СменаОткрыта = Истина;
			Иначе
				ОписаниеОшибки = НСтр("ru='С момента открытия кассовой смены истекло более 24 часов. Необходимо выполнить закрытие кассовой смены';uk='З моменту відкриття касової зміни минуло більше 24 годин. Необхідно виконати закриття касової зміни'");
				СменаОткрыта = Ложь;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.СтатусКассовойСмены) Тогда
			
			Если Выборка.ОкончаниеКассовойСмены >= Дата И Выборка.НачалоКассовойСмены <= Дата Тогда
				СменаОткрыта = Истина;
			Иначе
				ОписаниеОшибки = НСтр("ru='Смена не открыта';uk='Зміна не відчинені'");
				СменаОткрыта = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ОписаниеОшибки = НСтр("ru='Смена не открыта';uk='Зміна не відчинені'");
		СменаОткрыта = Ложь;
		
	КонецЕсли;
	
	Возврат СменаОткрыта;
	
КонецФункции // СменаОткрыта()
